Revit 2026 API

# Mesh Class

---

A triangular mesh.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBMesh

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Mesh : GeometryObject
```
```vb
Public Class Mesh
	Inherits GeometryObject
```
```cpp
public ref class Mesh : public GeometryObject
```
```fsharp
type Mesh =
    class
        inherit GeometryObject
    end
```

The Mesh type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistributionOfNormals | Indicates the distribution of normal vectors along the tessellated mesh surface. |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle(Inherited from GeometryObject) |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement.(Inherited from GeometryObject) |
|  | IsClosed | Indicates whether the mesh is closed. |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element.(Inherited from GeometryObject) |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | MaterialElementId | Element ID of the material from which this mesh is composed. |
|  | NumberOfNormals | The number of normals associated with the mesh. |
|  | NumTriangles | The number of triangles that the mesh contains. |
|  | Transformed | Transforms this mesh and returns the result. |
|  | Triangle | Retrieves a specific triangle. |
|  | Vertices | Retrieves all vertices used to define this mesh. Intended for indexed access. |
|  | Visibility | The visibility.(Inherited from GeometryObject) |

|  | Name | Description |
| --- | --- | --- |
|  | ComputeSurfaceArea | Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the constituent facets of the mesh. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Inherited from GeometryObject) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Inherited from GeometryObject) |
|  | GetNormal | Returns a normal unit vector at the given index. |
|  | GetNormals | Returns all normals assigned to the mesh. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Meshes are generated during triangulation of faces. They can also be encountered directly in Revit geometry (typically imported geometry). Meshes contain a single array of Vertices, and a corresponding array of triangles. Triangles can be accessed by index from TriangleInt32, and reference 3 vertices from the Vertices array.

#### Reference

Autodesk.Revit.DB Namespace